Documents/ОтчетПоВыплатамИУдержаниямПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ОтчетПоВыплатамИУдержаниямПН</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Годовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерНалоговойРегистрации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОДПН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетГодовой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДохода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОДПН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМатериальнойВыгоды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПНСМатериальнойВыгоды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтчетПоВыплатамИУдержаниямПН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция -ПолучитьКонтактнуюИнформацию
//
// Параметры:
//  Организация  - Спр.Ссылка - Спр.Органинизации 
// Возвращаемое значение:
//  Структура   - структура данных контактной информации
//
Функция ПолучитьКонтактнуюИнформацию(Организация)
	
	СведенияОбОрганизации = БухгалтерскийУчетСервер.ПолучитьСведенияОбОрганизации(Организация);
	
	ГородНасПункт = СведенияОбОрганизации.Город;
	АдрОбластьГород = ?(СведенияОбОрганизации.Регион = "","",СведенияОбОрганизации.Регион + ",")
	+ ?(СведенияОбОрганизации.Район  = "","", " " + СведенияОбОрганизации.Район + ",") 
		+ ?(ГородНасПункт = "",""," " + ГородНасПункт); 
	АдресОрганизации = ?(СведенияОбОрганизации.Улица    = "","",СведенияОбОрганизации.Улица + ",")
		+ ?(СведенияОбОрганизации.Дом      = "",""," " + СведенияОбОрганизации.Дом + ",")
		+ ?(СведенияОбОрганизации.Корпус   = "",""," " + СведенияОбОрганизации.Корпус + ",")
		+ ?(СведенияОбОрганизации.Квартира = "",""," " + СведенияОбОрганизации.Квартира);
		
	Телефон							= СведенияОбОрганизации.Тел;
	ЭлПочта 						= СведенияОбОрганизации.Email;
	ОКПО              				= СведенияОбОрганизации.ОКПО;
	ИНН 							= СведенияОбОрганизации.ИНН;
	ГНСНаименование                 = СведенияОбОрганизации.ГНСНаименование;
	ГНСКод 							= СведенияОбОрганизации.ГНСКод;
	ОрганизацияНаименованиеПолное   = СведенияОбОрганизации.НаименованиеПолное;
	Индекс  						= СведенияОбОрганизации.Индекс;

	Структура = Новый Структура();
	Структура.Вставить("ИНН", ИНН);
	Структура.Вставить("ОКПО", ОКПО);
	Структура.Вставить("ГНСКод", ГНСКод);
	Структура.Вставить("Индекс", Индекс);
	Структура.Вставить("Телефон", Телефон);
	Структура.Вставить("ЭлПочта", ЭлПочта);
	Структура.Вставить("АдрОбластьГород", АдрОбластьГород);
	Структура.Вставить("ГНСНаименование", ГНСНаименование);
	Структура.Вставить("АдресОрганизации", АдресОрганизации);
	Структура.Вставить("ОрганизацияНаименованиеПолное", ОрганизацияНаименованиеПолное);
	
	Возврат Структура;
	
КонецФункции // ПолучитьКонтактнуюИнформацию()

Функция НоваяСтруктураПараметровИННФЛ()
	
	СтруктураПараметровИННФЛ = Новый Структура;
	СтруктураПараметровИННФЛ.Вставить("ИНН1", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН2", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН3", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН4", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН5", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН6", "");		
	СтруктураПараметровИННФЛ.Вставить("ИНН7", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН8", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН9", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН10", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН11", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН12", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН13", "");
	СтруктураПараметровИННФЛ.Вставить("ИНН14", "");	

	Возврат СтруктураПараметровИННФЛ;
	
КонецФункции 

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

Функция ПечатьSTI_017_1Страница(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.Номер,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.ДатаНачала,
		|	ТаблицаДокумента.ДатаОкончания,
		|	ТаблицаДокумента.Отчет.(
		|		НомерСтроки,
		|		ФизЛицо,
		|		КодСтраны,
		|		ОДПН,
		|		СуммаПН
		|	)
		|ИЗ
		|	Документ.ОтчетПоВыплатамИУдержаниямПН КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";

	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_STI_017_1Страница";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_017_1Страница");
	
	Пока Шапка.Следующий() Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;	
		
		// Контактные данные
		КонтактныеДанные = ПолучитьКонтактнуюИнформацию(Шапка.Организация);

		// Шапка титульного листа
		ДанныеПечати.Вставить("НаименованиеОрганизации", СокрЛП(КонтактныеДанные.ОрганизацияНаименованиеПолное));
		
		ГНСКод = КонтактныеДанные.ГНСКод;
		ДанныеПечати.Вставить("ГНС1", Сред(Строка(ГНСКод),1,1));
		ДанныеПечати.Вставить("ГНС2", Сред(Строка(ГНСКод),2,1));
		ДанныеПечати.Вставить("ГНС3", Сред(Строка(ГНСКод),3,1));
		
		ДанныеПечати.Вставить("НаименованиеНалоговой", КонтактныеДанные.ГНСНаименование);
		
		ОКПО = КонтактныеДанные.ОКПО;
		ДанныеПечати.Вставить("ОКПО1", Сред(Строка(ОКПО),1,1));
		ДанныеПечати.Вставить("ОКПО2", Сред(Строка(ОКПО),2,1));
		ДанныеПечати.Вставить("ОКПО3", Сред(Строка(ОКПО),3,1));
		ДанныеПечати.Вставить("ОКПО4", Сред(Строка(ОКПО),4,1));
		ДанныеПечати.Вставить("ОКПО5", Сред(Строка(ОКПО),5,1));
		ДанныеПечати.Вставить("ОКПО6", Сред(Строка(ОКПО),6,1));
		ДанныеПечати.Вставить("ОКПО7", Сред(Строка(ОКПО),7,1));
		ДанныеПечати.Вставить("ОКПО8", Сред(Строка(ОКПО),8,1));
		
		ДанныеПечати.Вставить("ЮрАдрес", КонтактныеДанные.АдресОрганизации);		
		ДанныеПечати.Вставить("Телефон", КонтактныеДанные.Телефон);
		ДанныеПечати.Вставить("ЭлПочта", КонтактныеДанные.ЭлПочта);
		ДанныеПечати.Вставить("АдресГород", КонтактныеДанные.АдрОбластьГород);		
		
		Индекс = КонтактныеДанные.Индекс;
		
		Если ЗначениеЗаполнено(Индекс) ТОгда
			ДанныеПечати.Вставить("ИНД1", Сред(Индекс,1,1));
			ДанныеПечати.Вставить("ИНД2", Сред(Индекс,2,1));
			ДанныеПечати.Вставить("ИНД3", Сред(Индекс,3,1));
			ДанныеПечати.Вставить("ИНД4", Сред(Индекс,4,1));
			ДанныеПечати.Вставить("ИНД5", Сред(Индекс,5,1));
			ДанныеПечати.Вставить("ИНД6", Сред(Индекс,6,1));			
		КонецЕсли;
		
		//ИНН
		ИНН = КонтактныеДанные.ИНН;
		ДанныеПечати.Вставить("ИНН1", Сред(Строка(ИНН),1,1));
		ДанныеПечати.Вставить("ИНН2", Сред(Строка(ИНН),2,1));
		ДанныеПечати.Вставить("ИНН3", Сред(Строка(ИНН),3,1));
		ДанныеПечати.Вставить("ИНН4", Сред(Строка(ИНН),4,1));
		ДанныеПечати.Вставить("ИНН5", Сред(Строка(ИНН),5,1));
		ДанныеПечати.Вставить("ИНН6", Сред(Строка(ИНН),6,1));
		ДанныеПечати.Вставить("ИНН7", Сред(Строка(ИНН),7,1));
		ДанныеПечати.Вставить("ИНН8", Сред(Строка(ИНН),8,1));
		ДанныеПечати.Вставить("ИНН9", Сред(Строка(ИНН),9,1));
		ДанныеПечати.Вставить("ИНН10", Сред(Строка(ИНН),10,1));
		ДанныеПечати.Вставить("ИНН11", Сред(Строка(ИНН),11,1));
		ДанныеПечати.Вставить("ИНН12", Сред(Строка(ИНН),12,1));
		ДанныеПечати.Вставить("ИНН13", Сред(Строка(ИНН),13,1));
		ДанныеПечати.Вставить("ИНН14", Сред(Строка(ИНН),14,1));
		
		НачалоПериода = Шапка.ДатаНачала;
		КонецПериода  = Шапка.ДатаОкончания;
		
		ДанныеПечати.Вставить("ДатаН1", Сред(НачалоПериода, 1, 1));	
		ДанныеПечати.Вставить("ДатаН2", Сред(НачалоПериода, 2, 1));	
		ДанныеПечати.Вставить("ДатаН3", Сред(НачалоПериода, 4, 1));	
		ДанныеПечати.Вставить("ДатаН4", Сред(НачалоПериода, 5, 1));	
		ДанныеПечати.Вставить("ДатаН5", Сред(НачалоПериода, 7, 1));	
		ДанныеПечати.Вставить("ДатаН6", Сред(НачалоПериода, 8, 1));	
		ДанныеПечати.Вставить("ДатаН7", Сред(НачалоПериода, 9, 1));	
		ДанныеПечати.Вставить("ДатаН8", Сред(НачалоПериода, 10, 1));	
		
		ДанныеПечати.Вставить("ДатаК1", Сред(КонецПериода, 1, 1));	
		ДанныеПечати.Вставить("ДатаК2", Сред(КонецПериода, 2, 1));	
		ДанныеПечати.Вставить("ДатаК3", Сред(КонецПериода, 4, 1));	
		ДанныеПечати.Вставить("ДатаК4", Сред(КонецПериода, 5, 1));	
		ДанныеПечати.Вставить("ДатаК5", Сред(КонецПериода, 7, 1));	
		ДанныеПечати.Вставить("ДатаК6", Сред(КонецПериода, 8, 1));	
		ДанныеПечати.Вставить("ДатаК7", Сред(КонецПериода, 9, 1));	
		ДанныеПечати.Вставить("ДатаК8", Сред(КонецПериода, 10, 1));
				
		ДанныеПечати.Вставить("Квартал");
		
		// Период квартал
		Если Месяц(Шапка.ДатаОкончания) = 3 тогда
			ДанныеПечати.Квартал = "1";
		ИначеЕсли Месяц(Шапка.ДатаОкончания) = 6 тогда
			ДанныеПечати.Квартал = "2";
		ИначеЕсли Месяц(Шапка.ДатаОкончания) = 9 тогда
			ДанныеПечати.Квартал = "3";
		ИначеЕсли Месяц(Шапка.ДатаОкончания) = 12 тогда
			ДанныеПечати.Квартал = "4";
		КонецЕсли;
		
		//Налоговый период за год
		ДанныеПечати.Вставить("ГОД_1", Сред(Формат(Год(Шапка.ДатаОкончания),"ЧЦ=4; ЧГ=0"),1,1));
		ДанныеПечати.Вставить("ГОД_2", Сред(Формат(Год(Шапка.ДатаОкончания),"ЧЦ=4; ЧГ=0"),2,1));
		ДанныеПечати.Вставить("ГОД_3", Сред(Формат(Год(Шапка.ДатаОкончания),"ЧЦ=4; ЧГ=0"),3,1));
		ДанныеПечати.Вставить("ГОД_4", Сред(Формат(Год(Шапка.ДатаОкончания),"ЧЦ=4; ЧГ=0"),4,1));

		ТаблицаДокумента = Шапка.Отчет.Выгрузить();
		КолвоСтрок = ТаблицаДокумента.Количество();	
		КолвоЛистов = КолвоСтрок / 29;
		Если КолвоЛистов - Цел(КолвоЛистов) <> 0 Тогда  		
			КолвоЛистов = Цел(КолвоЛистов) + 1;
		КонецЕсли;
		
		//Номера страниц
		ДанныеПечати.Вставить("КолЛист1");
		ДанныеПечати.Вставить("КолЛист2");
		ДанныеПечати.Вставить("КолЛист3");
		
		стрКолвоЛистов = Строка(КолвоЛистов);
		Если  СтрДлина(стрКолвоЛистов) = 1 Тогда
			ДанныеПечати.КолЛист3 = Сред(стрКолвоЛистов,1,1);
		ИначеЕсли СтрДлина(стрКолвоЛистов) = 2 Тогда
			ДанныеПечати.КолЛист3 = Сред(стрКолвоЛистов,2,1);
			ДанныеПечати.КолЛист2 = Сред(стрКолвоЛистов,1,1);
		ИначеЕсли СтрДлина(стрКолвоЛистов) = 3 Тогда
			ДанныеПечати.КолЛист3 = Сред(стрКолвоЛистов,3,1);
			ДанныеПечати.КолЛист2 = Сред(стрКолвоЛистов,2,1);
			ДанныеПечати.КолЛист1 = Сред(стрКолвоЛистов,1,1);
		КонецЕсли;
		
		ДанныеПечати.Вставить("ОДПН", ТаблицаДокумента.Итог("ОДПН"));
		ДанныеПечати.Вставить("СуммаПН", ТаблицаДокумента.Итог("СуммаПН"));
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьТитЛист");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);		
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьSTI_017_2Страница(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.Номер КАК Номер,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.ДатаНачала КАК ДатаНачала,
		|	ТаблицаДокумента.ДатаОкончания КАК ДатаОкончания,
		|	ТаблицаДокумента.Организация.ИНН КАК ИНН,
		|	ТаблицаДокумента.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ТаблицаДокумента.Организация.ГНС.Наименование КАК ГНСНаименование,
		|	ТаблицаДокумента.Организация.ГНС.Код КАК ГНСКод,
		|	ТаблицаДокумента.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ТаблицаДокумента.Отчет.(
		|		НомерСтроки КАК НомерСтроки,
		|		ФизЛицо КАК ФизЛицо,
		|		КодСтраны КАК КодСтраны,
		|		ОДПН КАК ОДПН,
		|		СуммаПН КАК СуммаПН,
		|		ФизЛицо.ИНН КАК НомерНалоговойРегистрации
		|	) КАК Отчет
		|ИЗ
		|	Документ.ОтчетПоВыплатамИУдержаниямПН КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";

	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_STI_017_2Страница";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_017_2Страница");
	
	Пока Шапка.Следующий() Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;	
		ДанныеПечати.Вставить("КолЛист3");
		
		ОбластьЗаголовокЛ2 	= Макет.ПолучитьОбласть("ЗаголовокЛ2");	
		ОбластьЗаголовокЛЗ 	= Макет.ПолучитьОбласть("ЗаголовокЛЗ");	
		ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока		= Макет.ПолучитьОбласть("СтрокаОтчета");
		ОбластьПодвал 		= Макет.ПолучитьОбласть("Подвал");
		ОбластьИтого 		= Макет.ПолучитьОбласть("Итого");
		
		ТаблицаДокумента = Шапка.Отчет.Выгрузить();
		КолвоСтрок = ТаблицаДокумента.Количество();	
		КолвоЛистов = КолвоСтрок / 29;//16;
		Если КолвоЛистов - Цел(КолвоЛистов) <> 0 Тогда  		
			КолвоЛистов = Цел(КолвоЛистов) + 1;
		КонецЕсли;
	
		//Заголовок стр. 2	
		НомерЛиста = 1;
		
		Если НомерЛиста = КолвоЛистов Тогда
			ДанныеПечати.КолЛист3 = НомерЛиста;
			ОбластьЗаголовокЛЗ.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокЛЗ);
		Иначе 
			ДанныеПечати.КолЛист3 = НомерЛиста;
			ОбластьЗаголовокЛ2.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокЛ2);		
		КонецЕсли;

		// Заполнение шапки
		ДанныеПечати.Вставить("НаименованиеОрганизации", СокрЛП(Шапка.ОрганизацияНаименованиеПолное));
		
		ГНСКод = Шапка.ГНСКод;
		ДанныеПечати.Вставить("ГНС1", Сред(Строка(ГНСКод),1,1));
		ДанныеПечати.Вставить("ГНС2", Сред(Строка(ГНСКод),2,1));
		ДанныеПечати.Вставить("ГНС3", Сред(Строка(ГНСКод),3,1));
		
		ДанныеПечати.Вставить("НаименованиеНалоговой", Шапка.ГНСНаименование);
		
		ОКПО = Шапка.КодПоОКПО;
		ДанныеПечати.Вставить("ОКПО1", Сред(Строка(ОКПО),1,1));
		ДанныеПечати.Вставить("ОКПО2", Сред(Строка(ОКПО),2,1));
		ДанныеПечати.Вставить("ОКПО3", Сред(Строка(ОКПО),3,1));
		ДанныеПечати.Вставить("ОКПО4", Сред(Строка(ОКПО),4,1));
		ДанныеПечати.Вставить("ОКПО5", Сред(Строка(ОКПО),5,1));
		ДанныеПечати.Вставить("ОКПО6", Сред(Строка(ОКПО),6,1));
		ДанныеПечати.Вставить("ОКПО7", Сред(Строка(ОКПО),7,1));
		ДанныеПечати.Вставить("ОКПО8", Сред(Строка(ОКПО),8,1));
				
		//ИНН
		ИНН = Шапка.ИНН;
		ДанныеПечати.Вставить("ИНН1", Сред(Строка(ИНН),1,1));
		ДанныеПечати.Вставить("ИНН2", Сред(Строка(ИНН),2,1));
		ДанныеПечати.Вставить("ИНН3", Сред(Строка(ИНН),3,1));
		ДанныеПечати.Вставить("ИНН4", Сред(Строка(ИНН),4,1));
		ДанныеПечати.Вставить("ИНН5", Сред(Строка(ИНН),5,1));
		ДанныеПечати.Вставить("ИНН6", Сред(Строка(ИНН),6,1));
		ДанныеПечати.Вставить("ИНН7", Сред(Строка(ИНН),7,1));
		ДанныеПечати.Вставить("ИНН8", Сред(Строка(ИНН),8,1));
		ДанныеПечати.Вставить("ИНН9", Сред(Строка(ИНН),9,1));
		ДанныеПечати.Вставить("ИНН10", Сред(Строка(ИНН),10,1));
		ДанныеПечати.Вставить("ИНН11", Сред(Строка(ИНН),11,1));
		ДанныеПечати.Вставить("ИНН12", Сред(Строка(ИНН),12,1));
		ДанныеПечати.Вставить("ИНН13", Сред(Строка(ИНН),13,1));
		ДанныеПечати.Вставить("ИНН14", Сред(Строка(ИНН),14,1));
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Вывод таблицы
		Счетчик = 0;                  	
		ВсегоВыведеноСтрок = 0;
		СтрокНаЛисте = 0; 	
		
		ОДПН = 0;
		СуммаПН          = 0;
			
		Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
			
			Если Счетчик <= 28 Тогда //15 Тогда
				ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("КодСтраны1","");
				СтруктураПараметров.Вставить("КодСтраны2","");
				СтруктураПараметров.Вставить("КодСтраны3","");
				
				// КодСтраны
				Если ЗначениеЗаполнено(СтрокаТаблицы.КодСтраны) Тогда 
					
					КодСтраны = СтрокаТаблицы.КодСтраны;
					СтруктураПараметров.КодСтраны1 = Сред(Строка(КодСтраны),1,1);
					СтруктураПараметров.КодСтраны2 = Сред(Строка(КодСтраны),2,1);
					СтруктураПараметров.КодСтраны3 = Сред(Строка(КодСтраны),3,1);
					
				КонецЕсли;
				
				ОДПН = ОДПН + СтрокаТаблицы.ОДПН;
				СуммаПН          = СуммаПН + СтрокаТаблицы.СуммаПН;
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				ВсегоВыведеноСтрок = ВсегоВыведеноСтрок + 1;
				СтрокНаЛисте = СтрокНаЛисте + 1; 
				
				// проверка на то что осталось еще вывести пустые строки
				// чтобы не было чистых мест на листах отчета
				
				ОсталостьСтрок = СтрокНаЛисте - ВсегоВыведеноСтрок;
				
			ИначеЕсли Счетчик > 27 Тогда //14 Тогда 
				Счетчик = 0;
				СтрокНаЛисте = 0;
				НомерЛиста = НомерЛиста + 1;
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("ОДПН", ОДПН);
				СтруктураПараметров.Вставить("СуммаПН", СуммаПН);
				
				СтруктураПараметров.Вставить("КолЛист1");
				СтруктураПараметров.Вставить("КолЛист2");
				СтруктураПараметров.Вставить("КолЛист3");	
				
				//Итоги на странице
				ОбластьИтого.Параметры.Заполнить(СтруктураПараметров);
				ТабличныйДокумент.Вывести(ОбластьИтого);
				
				ОДПН = 0;
				СуммаПН          = 0;
				ТабличныйДокумент.Вывести(ОбластьПодвал);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				//Вывод ЗаклюЧительного Листа	
				
				Если НомерЛиста = КолвоЛистов тогда
					стрНомерЛиста =  Строка(НомерЛиста);
					Если  СтрДлина(стрНомерЛиста) = 1 Тогда
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,1,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 2 Тогда
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,2,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 3 Тогда
						СтруктураПараметров.КолЛист1 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,2,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,3,1);
					КонецЕсли;		
					ОбластьЗаголовокЛЗ.Параметры.Заполнить(СтруктураПараметров);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокЛЗ );
					ТабличныйДокумент.Вывести(ОбластьШапка);
				Иначе 
					
					стрНомерЛиста =  Строка(НомерЛиста);
					Если  СтрДлина(стрНомерЛиста) = 1 Тогда
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,1,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 2 Тогда
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,2,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 3 Тогда
						СтруктураПараметров.КолЛист1 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,2,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,3,1);
					КонецЕсли;	
					ОбластьЗаголовокЛ2.Параметры.Заполнить(СтруктураПараметров);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокЛ2);
					ТабличныйДокумент.Вывести(ОбластьШапка);
				КонецЕсли;
				
				ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("КодСтраны1","");
				СтруктураПараметров.Вставить("КодСтраны2","");
				СтруктураПараметров.Вставить("КодСтраны3","");

				// КодСтраны
				Если ЗначениеЗаполнено(СтрокаТаблицы.КодСтраны) Тогда 
					
					КодСтраны = СтрокаТаблицы.КодСтраны;
					СтруктураПараметров.КодСтраны1 = Сред(Строка(КодСтраны),1,1);
					СтруктураПараметров.КодСтраны2 = Сред(Строка(КодСтраны),2,1);
					СтруктураПараметров.КодСтраны3 = Сред(Строка(КодСтраны),3,1);
					
				КонецЕсли;
				
				ОДПН = ОДПН + СтрокаТаблицы.ОДПН;
				СуммаПН          = СуммаПН + СтрокаТаблицы.СуммаПН;
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				ВсегоВыведеноСтрок = ВсегоВыведеноСтрок + 1;
				
				СтрокНаЛисте = СтрокНаЛисте + 1; 
				
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
		НехваткаНаЛист = 28 - СтрокНаЛисте; //15
		
		Пока НехваткаНаЛист > 0 Цикл
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаОтчета");
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			НехваткаНаЛист = НехваткаНаЛист - 1 ;
		КонецЦикла;
		
		//Итоги на странице
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОДПН", ОДПН);
		СтруктураПараметров.Вставить("СуммаПН", СуммаПН);
		
		ОбластьИтого.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		Если НомерЛиста = КолвоЛистов Тогда
			ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
			
			ДанныеПечати.Вставить("ОДПН", ТаблицаДокумента.Итог("ОДПН"));
			ДанныеПечати.Вставить("СуммаПН", ТаблицаДокумента.Итог("СуммаПН"));
			ЗаполнитьЗначенияСвойств(ОбластьКомментарий.Параметры,ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьКомментарий);	
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);		
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьSTI_058_1Страница(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.Номер,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.ДатаНачала,
		|	ТаблицаДокумента.ДатаОкончания,
		|	ТаблицаДокумента.ОтчетГодовой.(
		|		НомерСтроки,
		|		ФизЛицо,
		|		ИНН,
		|		ОДПН,
		|		СуммаМатериальнойВыгоды,
		|		СуммаПН,
		|		СуммаПНСМатериальнойВыгоды
		|	)
		|ИЗ
		|	Документ.ОтчетПоВыплатамИУдержаниямПН КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";

	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_STI_058_1Страница";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_058_1Страница");
	
	Пока Шапка.Следующий() Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;	
		
		// Контактные данные
		КонтактныеДанные = ПолучитьКонтактнуюИнформацию(Шапка.Организация);
		
		// Шапка титульного листа
		ДанныеПечати.Вставить("НаименованиеОрганизации", СокрЛП(КонтактныеДанные.ОрганизацияНаименованиеПолное));
		
		ГНСКод = КонтактныеДанные.ГНСКод;
		ДанныеПечати.Вставить("ГНС1", Сред(Строка(ГНСКод),1,1));
		ДанныеПечати.Вставить("ГНС2", Сред(Строка(ГНСКод),2,1));
		ДанныеПечати.Вставить("ГНС3", Сред(Строка(ГНСКод),3,1));
		
		ДанныеПечати.Вставить("НаименованиеНалоговой", КонтактныеДанные.ГНСНаименование);
		
		ОКПО = КонтактныеДанные.ОКПО;
		ДанныеПечати.Вставить("ОКПО1", Сред(Строка(ОКПО),1,1));
		ДанныеПечати.Вставить("ОКПО2", Сред(Строка(ОКПО),2,1));
		ДанныеПечати.Вставить("ОКПО3", Сред(Строка(ОКПО),3,1));
		ДанныеПечати.Вставить("ОКПО4", Сред(Строка(ОКПО),4,1));
		ДанныеПечати.Вставить("ОКПО5", Сред(Строка(ОКПО),5,1));
		ДанныеПечати.Вставить("ОКПО6", Сред(Строка(ОКПО),6,1));
		ДанныеПечати.Вставить("ОКПО7", Сред(Строка(ОКПО),7,1));
		ДанныеПечати.Вставить("ОКПО8", Сред(Строка(ОКПО),8,1));
		
		ДанныеПечати.Вставить("ЮрАдрес", КонтактныеДанные.АдресОрганизации);		
		ДанныеПечати.Вставить("Телефон", КонтактныеДанные.Телефон);
		ДанныеПечати.Вставить("ЭлПочта", КонтактныеДанные.ЭлПочта);
		ДанныеПечати.Вставить("АдресГород", КонтактныеДанные.АдрОбластьГород);		
		
		Индекс = КонтактныеДанные.Индекс;
		
		Если ЗначениеЗаполнено(Индекс) ТОгда
			ДанныеПечати.Вставить("ИНД1", Сред(Индекс,1,1));
			ДанныеПечати.Вставить("ИНД2", Сред(Индекс,2,1));
			ДанныеПечати.Вставить("ИНД3", Сред(Индекс,3,1));
			ДанныеПечати.Вставить("ИНД4", Сред(Индекс,4,1));
			ДанныеПечати.Вставить("ИНД5", Сред(Индекс,5,1));
			ДанныеПечати.Вставить("ИНД6", Сред(Индекс,6,1));			
		КонецЕсли;
		
		//ИНН
		ИНН = КонтактныеДанные.ИНН;
		ДанныеПечати.Вставить("ИНН1", Сред(Строка(ИНН),1,1));
		ДанныеПечати.Вставить("ИНН2", Сред(Строка(ИНН),2,1));
		ДанныеПечати.Вставить("ИНН3", Сред(Строка(ИНН),3,1));
		ДанныеПечати.Вставить("ИНН4", Сред(Строка(ИНН),4,1));
		ДанныеПечати.Вставить("ИНН5", Сред(Строка(ИНН),5,1));
		ДанныеПечати.Вставить("ИНН6", Сред(Строка(ИНН),6,1));
		ДанныеПечати.Вставить("ИНН7", Сред(Строка(ИНН),7,1));
		ДанныеПечати.Вставить("ИНН8", Сред(Строка(ИНН),8,1));
		ДанныеПечати.Вставить("ИНН9", Сред(Строка(ИНН),9,1));
		ДанныеПечати.Вставить("ИНН10", Сред(Строка(ИНН),10,1));
		ДанныеПечати.Вставить("ИНН11", Сред(Строка(ИНН),11,1));
		ДанныеПечати.Вставить("ИНН12", Сред(Строка(ИНН),12,1));
		ДанныеПечати.Вставить("ИНН13", Сред(Строка(ИНН),13,1));
		ДанныеПечати.Вставить("ИНН14", Сред(Строка(ИНН),14,1));
		
		ДатаН = Шапка.ДатаНачала;
		ДатаК = Шапка.ДатаОкончания;
		
		//Налоговый период 	
		ДанныеПечати.Вставить("ДатаН1", Сред(Формат(ДатаН,"dd"),1,1));	
		ДанныеПечати.Вставить("ДатаН2", Сред(Формат(ДатаН,"dd"),2,1));	
		ДанныеПечати.Вставить("ДатаН3", Сред(Формат(ДатаН,"MM"),4,1));
		ДанныеПечати.Вставить("ДатаН4", Сред(Формат(ДатаН,"MM"),5,1));
		ДанныеПечати.Вставить("ДатаН5", Сред(Формат(ДатаН,"yyyy"),7,1));
		ДанныеПечати.Вставить("ДатаН6", Сред(Формат(ДатаН,"yyyy"),8,1));
		ДанныеПечати.Вставить("ДатаН7", Сред(Формат(ДатаН,"yyyy"),9,1));
		ДанныеПечати.Вставить("ДатаН8", Сред(Формат(ДатаН,"yyyy"),10,1));
		
		ДанныеПечати.Вставить("ДатаК1", Сред(Формат(ДатаК,"dd"),1,1));
		ДанныеПечати.Вставить("ДатаК2", Сред(Формат(ДатаК,"dd"),2,1));								
		ДанныеПечати.Вставить("ДатаК3", Сред(Формат(ДатаК,"MM"),4,1));
		ДанныеПечати.Вставить("ДатаК4", Сред(Формат(ДатаК,"MM"),5,1));							
		ДанныеПечати.Вставить("ДатаК5", Сред(Формат(ДатаК,"yyyy"),7,1));
		ДанныеПечати.Вставить("ДатаК6", Сред(Формат(ДатаК,"yyyy"),8,1));
		ДанныеПечати.Вставить("ДатаК7", Сред(Формат(ДатаК,"yyyy"),9,1));
		ДанныеПечати.Вставить("ДатаК8", Сред(Формат(ДатаК,"yyyy"),10,1));	

		
		ТаблицаДокумента = Шапка.ОтчетГодовой.Выгрузить();
		КолвоСтрок = ТаблицаДокумента.Количество();	
		КолвоЛистов = КолвоСтрок / 15;
		Если КолвоЛистов - Цел(КолвоЛистов) <> 0 Тогда  		
			КолвоЛистов = Цел(КолвоЛистов) + 1;
		КонецЕсли;
		
		//Номера страниц
		ДанныеПечати.Вставить("КолЛист1");
		ДанныеПечати.Вставить("КолЛист2");
		ДанныеПечати.Вставить("КолЛист3");
		
		стрКолвоЛистов = Строка(КолвоЛистов);
		Если  СтрДлина(стрКолвоЛистов) = 1 Тогда
			ДанныеПечати.КолЛист3 = Сред(стрКолвоЛистов,1,1);
		ИначеЕсли СтрДлина(стрКолвоЛистов) = 2 Тогда
			ДанныеПечати.КолЛист2 = Сред(стрКолвоЛистов,1,1);
			ДанныеПечати.КолЛист3 = Сред(стрКолвоЛистов,2,1);
		ИначеЕсли СтрДлина(стрКолвоЛистов) = 3 Тогда
			ДанныеПечати.КолЛист1 = Сред(стрКолвоЛистов,1,1);
			ДанныеПечати.КолЛист2 = Сред(стрКолвоЛистов,2,1);
			ДанныеПечати.КолЛист3 = Сред(стрКолвоЛистов,3,1);
		КонецЕсли;
		
		ДанныеПечати.Вставить("ОДПН", ТаблицаДокумента.Итог("ОДПН"));
		ДанныеПечати.Вставить("СуммаПН", ТаблицаДокумента.Итог("СуммаПН"));
		ДанныеПечати.Вставить("СуммаМатериальнойВыгоды", ТаблицаДокумента.Итог("СуммаМатериальнойВыгоды"));
		ДанныеПечати.Вставить("СуммаПНСМатериальнойВыгоды", ТаблицаДокумента.Итог("СуммаПНСМатериальнойВыгоды"));
	
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьТитЛист");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);		
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьSTI_058_2Страница(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.Номер,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.ДатаНачала,
		|	ТаблицаДокумента.ДатаОкончания,
		|	ТаблицаДокумента.Организация.ИНН КАК ИНН,
		|	ТаблицаДокумента.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ТаблицаДокумента.Организация.ГНС.Наименование КАК ГНСНаименование,
		|	ТаблицаДокумента.Организация.ГНС.Код КАК ГНСКод,
		|	ТаблицаДокумента.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ТаблицаДокумента.ОтчетГодовой.(
		|		НомерСтроки,
		|		ФизЛицо,
		|		ИНН,
		|		КодДохода,
		|		ОДПН,
		|		СуммаПН,
		|		СуммаМатериальнойВыгоды,
		|		СуммаПНСМатериальнойВыгоды
		|	)
		|ИЗ
		|	Документ.ОтчетПоВыплатамИУдержаниямПН КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";

	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_STI_058_2Страница";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_058_2Страница");
	
	Пока Шапка.Следующий() Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;	
		ДанныеПечати.Вставить("КолЛист3");
		
		ОбластьЗаголовокЛ2 	= Макет.ПолучитьОбласть("ЗаголовокЛ2");	
		ОбластьЗаголовокЛЗ 	= Макет.ПолучитьОбласть("ЗаголовокЛЗ");	
		ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока		= Макет.ПолучитьОбласть("СтрокаОтчета");
		ОбластьПодвал 		= Макет.ПолучитьОбласть("Подвал");
		ОбластьИтого 		= Макет.ПолучитьОбласть("Итого");
		
		ТаблицаДокумента = Шапка.ОтчетГодовой.Выгрузить();
		КолвоСтрок = ТаблицаДокумента.Количество();	
		КолвоЛистов = КолвоСтрок / 15;
		Если КолвоЛистов - Цел(КолвоЛистов) <> 0 Тогда  		
			КолвоЛистов = Цел(КолвоЛистов) + 1;
		КонецЕсли;
		
		//Заголовок стр. 2	
		НомерЛиста = 1;
		
		Если НомерЛиста = КолвоЛистов Тогда
			ДанныеПечати.КолЛист3 = НомерЛиста;
			ОбластьЗаголовокЛЗ.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокЛЗ);
		Иначе 
			ДанныеПечати.КолЛист3 = НомерЛиста;
			ОбластьЗаголовокЛ2.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокЛ2);		
		КонецЕсли;

		// Заполнение шапки
		ДанныеПечати.Вставить("НаименованиеОрганизации", СокрЛП(Шапка.ОрганизацияНаименованиеПолное));
		
		ГНСКод = Шапка.ГНСКод;
		ДанныеПечати.Вставить("ГНС1", Сред(Строка(ГНСКод),1,1));
		ДанныеПечати.Вставить("ГНС2", Сред(Строка(ГНСКод),2,1));
		ДанныеПечати.Вставить("ГНС3", Сред(Строка(ГНСКод),3,1));
		
		ДанныеПечати.Вставить("НаименованиеНалоговой", Шапка.ГНСНаименование);
		
		ОКПО = Шапка.КодПоОКПО;
		ДанныеПечати.Вставить("ОКПО1", Сред(Строка(ОКПО),1,1));
		ДанныеПечати.Вставить("ОКПО2", Сред(Строка(ОКПО),2,1));
		ДанныеПечати.Вставить("ОКПО3", Сред(Строка(ОКПО),3,1));
		ДанныеПечати.Вставить("ОКПО4", Сред(Строка(ОКПО),4,1));
		ДанныеПечати.Вставить("ОКПО5", Сред(Строка(ОКПО),5,1));
		ДанныеПечати.Вставить("ОКПО6", Сред(Строка(ОКПО),6,1));
		ДанныеПечати.Вставить("ОКПО7", Сред(Строка(ОКПО),7,1));
		ДанныеПечати.Вставить("ОКПО8", Сред(Строка(ОКПО),8,1));
				
		//ИНН
		ИНН = Шапка.ИНН;
		ДанныеПечати.Вставить("ИНН1", Сред(Строка(ИНН),1,1));
		ДанныеПечати.Вставить("ИНН2", Сред(Строка(ИНН),2,1));
		ДанныеПечати.Вставить("ИНН3", Сред(Строка(ИНН),3,1));
		ДанныеПечати.Вставить("ИНН4", Сред(Строка(ИНН),4,1));
		ДанныеПечати.Вставить("ИНН5", Сред(Строка(ИНН),5,1));
		ДанныеПечати.Вставить("ИНН6", Сред(Строка(ИНН),6,1));
		ДанныеПечати.Вставить("ИНН7", Сред(Строка(ИНН),7,1));
		ДанныеПечати.Вставить("ИНН8", Сред(Строка(ИНН),8,1));
		ДанныеПечати.Вставить("ИНН9", Сред(Строка(ИНН),9,1));
		ДанныеПечати.Вставить("ИНН10", Сред(Строка(ИНН),10,1));
		ДанныеПечати.Вставить("ИНН11", Сред(Строка(ИНН),11,1));
		ДанныеПечати.Вставить("ИНН12", Сред(Строка(ИНН),12,1));
		ДанныеПечати.Вставить("ИНН13", Сред(Строка(ИНН),13,1));
		ДанныеПечати.Вставить("ИНН14", Сред(Строка(ИНН),14,1));
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Вывод таблицы
		Счетчик = 0;                  	
		ВсегоВыведеноСтрок = 0;
		СтрокНаЛисте = 0; 	
		
		ОДПН = 0;
		СуммаПН          = 0;
		СуммаМатериальнойВыгоды 	= 0;
		СуммаПНСМатериальнойВыгоды 	= 0;
			
		Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
			
			Если Счетчик <= 14 Тогда
				ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
				
				СтруктураПараметровИННФЛ = НоваяСтруктураПараметровИННФЛ();
				// ИНН ФЛ
				Если ЗначениеЗаполнено(СтрокаТаблицы.ИНН) Тогда 
									
					ИНН = СтрокаТаблицы.ИНН;
					СтруктураПараметровИННФЛ.ИНН1   = Сред(Строка(ИНН),1,1);
					СтруктураПараметровИННФЛ.ИНН2   = Сред(Строка(ИНН),2,1);
					СтруктураПараметровИННФЛ.ИНН3   = Сред(Строка(ИНН),3,1);
					СтруктураПараметровИННФЛ.ИНН4   = Сред(Строка(ИНН),4,1);
					СтруктураПараметровИННФЛ.ИНН5   = Сред(Строка(ИНН),5,1);
					СтруктураПараметровИННФЛ.ИНН6   = Сред(Строка(ИНН),6,1);
					СтруктураПараметровИННФЛ.ИНН7   = Сред(Строка(ИНН),7,1);
					СтруктураПараметровИННФЛ.ИНН8   = Сред(Строка(ИНН),8,1);
					СтруктураПараметровИННФЛ.ИНН9   = Сред(Строка(ИНН),9,1);
					СтруктураПараметровИННФЛ.ИНН10  = Сред(Строка(ИНН),10,1);
					СтруктураПараметровИННФЛ.ИНН11  = Сред(Строка(ИНН),11,1);
					СтруктураПараметровИННФЛ.ИНН12  = Сред(Строка(ИНН),12,1);
					СтруктураПараметровИННФЛ.ИНН13  = Сред(Строка(ИНН),13,1);
					СтруктураПараметровИННФЛ.ИНН14  = Сред(Строка(ИНН),14,1);
					
				КонецЕсли;
				
				ОДПН = ОДПН + СтрокаТаблицы.ОДПН;
				СуммаПН          = СуммаПН + СтрокаТаблицы.СуммаПН;
				СуммаМатериальнойВыгоды 	= СуммаМатериальнойВыгоды + СтрокаТаблицы.СуммаМатериальнойВыгоды;
				СуммаПНСМатериальнойВыгоды	= СуммаПНСМатериальнойВыгоды + СтрокаТаблицы.СуммаПНСМатериальнойВыгоды;
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураПараметровИННФЛ);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				ВсегоВыведеноСтрок = ВсегоВыведеноСтрок + 1;
				СтрокНаЛисте = СтрокНаЛисте + 1; 
				
				// проверка на то что осталось еще вывести пустые строки
				// чтобы не было чистых мест на листах отчета
				
				ОсталостьСтрок = СтрокНаЛисте - ВсегоВыведеноСтрок;
				
			ИначеЕсли Счетчик > 13 Тогда 
				Счетчик = 0;
				СтрокНаЛисте = 0;
				НомерЛиста = НомерЛиста + 1;
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("ОДПН", ОДПН);
				СтруктураПараметров.Вставить("СуммаПН", СуммаПН);
				СтруктураПараметров.Вставить("СуммаМатериальнойВыгоды", СуммаМатериальнойВыгоды);
				СтруктураПараметров.Вставить("СуммаПНСМатериальнойВыгоды", СуммаПНСМатериальнойВыгоды);

				СтруктураПараметров.Вставить("КолЛист1");
				СтруктураПараметров.Вставить("КолЛист2");
				СтруктураПараметров.Вставить("КолЛист3");	
				
				//Итоги на странице
				ОбластьИтого.Параметры.Заполнить(СтруктураПараметров);
				ТабличныйДокумент.Вывести(ОбластьИтого);
				
				ОДПН = 0;
				СуммаПН          = 0;
				СуммаМатериальнойВыгоды 	= 0;
				СуммаПНСМатериальнойВыгоды 	= 0;
				
				ТабличныйДокумент.Вывести(ОбластьПодвал);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				//Вывод ЗаклюЧительного Листа	
				
				Если НомерЛиста = КолвоЛистов тогда
					стрНомерЛиста =  Строка(НомерЛиста);
					Если  СтрДлина(стрНомерЛиста) = 1 Тогда
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,1,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 2 Тогда
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,2,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 3 Тогда
						СтруктураПараметров.КолЛист1 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,2,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,3,1);
					КонецЕсли;		
					ОбластьЗаголовокЛЗ.Параметры.Заполнить(СтруктураПараметров);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокЛЗ );
					ТабличныйДокумент.Вывести(ОбластьШапка);
				Иначе 
					
					стрНомерЛиста =  Строка(НомерЛиста);
					Если  СтрДлина(стрНомерЛиста) = 1 Тогда
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,1,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 2 Тогда
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,2,1);
					ИначеЕсли СтрДлина(стрНомерЛиста) = 3 Тогда
						СтруктураПараметров.КолЛист1 = Сред(стрНомерЛиста,1,1);
						СтруктураПараметров.КолЛист2 = Сред(стрНомерЛиста,2,1);
						СтруктураПараметров.КолЛист3 = Сред(стрНомерЛиста,3,1);
					КонецЕсли;	
					ОбластьЗаголовокЛ2.Параметры.Заполнить(СтруктураПараметров);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокЛ2);
					ТабличныйДокумент.Вывести(ОбластьШапка);
				КонецЕсли;
				
				ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
				
				СтруктураПараметровИННФЛ = НоваяСтруктураПараметровИННФЛ();
				// ИНН ФЛ
				Если ЗначениеЗаполнено(СтрокаТаблицы.ИНН) Тогда 
									
					ИНН = СтрокаТаблицы.ИНН;
					СтруктураПараметровИННФЛ.ИНН1   = Сред(Строка(ИНН),1,1);
					СтруктураПараметровИННФЛ.ИНН2   = Сред(Строка(ИНН),2,1);
					СтруктураПараметровИННФЛ.ИНН3   = Сред(Строка(ИНН),3,1);
					СтруктураПараметровИННФЛ.ИНН4   = Сред(Строка(ИНН),4,1);
					СтруктураПараметровИННФЛ.ИНН5   = Сред(Строка(ИНН),5,1);
					СтруктураПараметровИННФЛ.ИНН6   = Сред(Строка(ИНН),6,1);
					СтруктураПараметровИННФЛ.ИНН7   = Сред(Строка(ИНН),7,1);
					СтруктураПараметровИННФЛ.ИНН8   = Сред(Строка(ИНН),8,1);
					СтруктураПараметровИННФЛ.ИНН9   = Сред(Строка(ИНН),9,1);
					СтруктураПараметровИННФЛ.ИНН10  = Сред(Строка(ИНН),10,1);
					СтруктураПараметровИННФЛ.ИНН11  = Сред(Строка(ИНН),11,1);
					СтруктураПараметровИННФЛ.ИНН12  = Сред(Строка(ИНН),12,1);
					СтруктураПараметровИННФЛ.ИНН13  = Сред(Строка(ИНН),13,1);
					СтруктураПараметровИННФЛ.ИНН14  = Сред(Строка(ИНН),14,1);
					
				КонецЕсли;
				
				ОДПН = ОДПН + СтрокаТаблицы.ОДПН;
				СуммаПН          = СуммаПН + СтрокаТаблицы.СуммаПН;
				СуммаМатериальнойВыгоды 	= СуммаМатериальнойВыгоды + СтрокаТаблицы.СуммаМатериальнойВыгоды;
				СуммаПНСМатериальнойВыгоды	= СуммаПНСМатериальнойВыгоды + СтрокаТаблицы.СуммаПНСМатериальнойВыгоды;
			
				ОбластьСтрока.Параметры.Заполнить(СтруктураПараметровИННФЛ);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				ВсегоВыведеноСтрок = ВсегоВыведеноСтрок + 1;
				
				СтрокНаЛисте = СтрокНаЛисте + 1; 
				
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
		НехваткаНаЛист = 14 - СтрокНаЛисте;
		
		Пока НехваткаНаЛист > 0 Цикл
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаОтчета");
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			НехваткаНаЛист = НехваткаНаЛист - 1 ;
		КонецЦикла;
		
		//Итоги на странице
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОДПН", ОДПН);
		СтруктураПараметров.Вставить("СуммаПН", СуммаПН);
		СтруктураПараметров.Вставить("СуммаМатериальнойВыгоды", СуммаМатериальнойВыгоды);
		СтруктураПараметров.Вставить("СуммаПНСМатериальнойВыгоды", СуммаПНСМатериальнойВыгоды);
		
		ОбластьИтого.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		//Итоги ВСЕГО, Если это заключительный лист
		Если НомерЛиста = КолвоЛистов Тогда
			ОбластьВсего = Макет.ПолучитьОбласть("Всего");
			
			ДанныеПечати.Вставить("ОДПН", ТаблицаДокумента.Итог("ОДПН"));
			ДанныеПечати.Вставить("СуммаПН", ТаблицаДокумента.Итог("СуммаПН"));
			ДанныеПечати.Вставить("СуммаМатериальнойВыгоды", ТаблицаДокумента.Итог("СуммаМатериальнойВыгоды"));
			ДанныеПечати.Вставить("СуммаПНСМатериальнойВыгоды", ТаблицаДокумента.Итог("СуммаПНСМатериальнойВыгоды"));

			ЗаполнитьЗначенияСвойств(ОбластьВсего.Параметры,ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьВсего);	
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);		
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_STI_017_1Страница") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_STI_017_1Страница", 
		"Отчет STI-017", 
		ПечатьSTI_017_1Страница(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_017_1Страница");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_STI_017_2Страница") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_STI_017_2Страница", 
		"Отчет STI-017 (приложение)", 
		ПечатьSTI_017_2Страница(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_017_2Страница");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_STI_058_1Страница") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_STI_058_1Страница", 
		"Отчет STI-058", 
		ПечатьSTI_058_1Страница(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_058_1Страница");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_STI_058_2Страница") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_STI_058_2Страница", 
		"Отчет STI-058 (приложение)", 
		ПечатьSTI_058_2Страница(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоВыплатамИУдержаниямПН.ПФ_MXL_STI_058_2Страница");
	КонецЕсли;

КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_STI_017_1Страница";
	КомандаПечати.Представление = НСтр("ru = 'Отчет STI-017'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Годовой", Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_STI_017_2Страница";
	КомандаПечати.Представление = НСтр("ru = 'Отчет STI-017 (приложение)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 2;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Годовой", Ложь);

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_STI_058_1Страница";
	КомандаПечати.Представление = НСтр("ru = 'Отчет STI-058'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 3;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Годовой", Истина);

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_STI_058_2Страница";
	КомандаПечати.Представление = НСтр("ru = 'Отчет STI-058 (приложение)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 4;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Годовой", Истина);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
